XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3LowPower_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>FM3LowPower_DFP</name>
  <description>Cypress FM3 Low Power Series Device Support</description>

  <releases>
    <release version="1.1.1" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained. Please contact the device vendor (Cypress) for support.
	</release>
    <release version="1.1.0" date="2019-05-28">
      Updated Device Vendor: changed from Spansion to Cypress.
      Updated device descriptions with features.
    </release>
    <release version="1.0.0">
      First Release version of FM3 Low Power Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Cypress</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Cypress</keyword>
    <keyword>FM3 Low Power</keyword>
    <keyword>MB9A</keyword>
    <keyword>MB9B</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="FM3 Low Power Series" Dvendor="Cypress:19">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
The FM3 Series is designed for cost-sensitive embedded control applications.
Typical applications include Industrial, Motor control, Factory automation, White goods, Power tools, Medical and healthcare, Hand-held devices

  - highly reliable Flash (100,000 erase/write cycles) with 0 wait states at 72MHz)
  - long term availablity (> 10 years)
        </description>

      <!-- ************************  Subfamily 'MB9AF140'  **************************** -->
      <subFamily DsubFamily="MB9AF140">
        <feature type="DMA"           n="8"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
      
      <!-- *************************  Device 'MB9AF141L'  ***************************** -->
      <device Dname="MB9AF141L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140l.h"  define="MB9AF141L"/>
        <debug      svd="SVD/MB9AF14xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_DualWflash32.FLM" start="0x00200000" size="0x8000"             default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF141M'  ***************************** -->
      <device Dname="MB9AF141M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140m.h"  define="MB9AF141M"/>
        <debug      svd="SVD/MB9AF14xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_DualWflash32.FLM" start="0x00200000" size="0x8000"             default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF141N'  ***************************** -->
      <device Dname="MB9AF141N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140n.h"  define="MB9AF141N"/>
        <debug      svd="SVD/MB9AF14xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_DualWflash32.FLM" start="0x00200000" size="0x8000"             default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF142L'  ***************************** -->
      <device Dname="MB9AF142L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140l.h"  define="MB9AF142L"/>
        <debug      svd="SVD/MB9AF14xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF142M'  ***************************** -->
      <device Dname="MB9AF142M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140m.h"  define="MB9AF142M"/>
        <debug      svd="SVD/MB9AF14xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF142N'  ***************************** -->
      <device Dname="MB9AF142N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140n.h"  define="MB9AF142N"/>
        <debug      svd="SVD/MB9AF14xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF144L'  ***************************** -->
      <device Dname="MB9AF144L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140l.h"  define="MB9AF144L"/>
        <debug      svd="SVD/MB9AF14xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
