XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3LowPower_DFP.pdsc
      <!-- *************************  Device 'MB9AF144M'  ***************************** -->
      <device Dname="MB9AF144M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140m.h"  define="MB9AF144M"/>
        <debug      svd="SVD/MB9AF14xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF144N'  ***************************** -->
      <device Dname="MB9AF144N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A140NA/mb9a140n.h"  define="MB9AF144N"/>
        <debug      svd="SVD/MB9AF14xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A140NA-DS706-00040-2v0-E.pdf"                    title="MB9A140NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9AF150'  **************************** -->
      <subFamily DsubFamily="MB9AF150">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
      
      <!-- *************************  Device 'MB9AF154M'  ***************************** -->
      <device Dname="MB9AF154M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150m.h"  define="MB9AF154M"/>
        <debug      svd="SVD/MB9AF15xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="MPSerial"      n="10"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF154N'  ***************************** -->
      <device Dname="MB9AF154N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150n.h"  define="MB9AF154N"/>
        <debug      svd="SVD/MB9AF15xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="MPSerial"      n="14"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF154R'  ***************************** -->
      <device Dname="MB9AF154R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150r.h"  define="MB9AF154R"/>
        <debug      svd="SVD/MB9AF15xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="MPSerial"      n="16"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9AF155M'  ***************************** -->
      <device Dname="MB9AF155M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150m.h"  define="MB9AF155M"/>
        <debug      svd="SVD/MB9AF15xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_384.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="MPSerial"      n="10"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF155N'  ***************************** -->
      <device Dname="MB9AF155N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150n.h"  define="MB9AF155N"/>
        <debug      svd="SVD/MB9AF15xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_384.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="MPSerial"      n="14"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AF155R'  ***************************** -->
      <device Dname="MB9AF155R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A150R/mb9a150r.h"  define="MB9AF155R"/>
        <debug      svd="SVD/MB9AF15xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_384.FLM"    start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AF156R-DS706-00047-1v0-E.pdf"                    title="MB9A150R Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="MPSerial"      n="16"                          name="UART / SIO / I2C"/>
        <feature type="IOs"           n="120"/>
      </device>
      
