XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3LowPower_DFP.pdsc
      <!-- *************************  Device 'MB9AF344L'  ***************************** -->
      <device Dname="MB9AF344L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A340NA/mb9a340l.h"  define="MB9AF344L"/>
        <debug      svd="SVD/MB9AF34xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A340NA-DS706-00039-2v0-E.pdf"                    title="MB9A340NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AF344M'  ***************************** -->
      <device Dname="MB9AF344M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A340NA/mb9a340m.h"  define="MB9AF344M"/>
        <debug      svd="SVD/MB9AF34xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A340NA-DS706-00039-2v0-E.pdf"                    title="MB9A340NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AF344N'  ***************************** -->
      <device Dname="MB9AF344N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9A340NA/mb9a340n.h"  define="MB9AF344N"/>
        <debug      svd="SVD/MB9AF34xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9A340NA-DS706-00039-2v0-E.pdf"                    title="MB9A340NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9AFA40'  **************************** -->
      <subFamily DsubFamily="MB9AFA40">
        <feature type="DMA"           n="8"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="LCD"           n="1"/>
      
      <!-- *************************  Device 'MB9AFA41L'  ***************************** -->
      <device Dname="MB9AFA41L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40l.h"  define="MB9AFA41L"/>
        <debug      svd="SVD/MB9AFA4xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA41M'  ***************************** -->
      <device Dname="MB9AFA41M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40m.h"  define="MB9AFA41M"/>
        <debug      svd="SVD/MB9AFA4xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
