XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3LowPower_DFP.pdsc
      <!-- *************************  Device 'MB9AFA41N'  ***************************** -->
      <device Dname="MB9AFA41N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40n.h"  define="MB9AFA41N"/>
        <debug      svd="SVD/MB9AFA4xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA42L'  ***************************** -->
      <device Dname="MB9AFA42L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40l.h"  define="MB9AFA42L"/>
        <debug      svd="SVD/MB9AFA4xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA42M'  ***************************** -->
      <device Dname="MB9AFA42M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40m.h"  define="MB9AFA42M"/>
        <debug      svd="SVD/MB9AFA4xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA42N'  ***************************** -->
      <device Dname="MB9AFA42N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40n.h"  define="MB9AFA42N"/>
        <debug      svd="SVD/MB9AFA4xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA44L'  ***************************** -->
      <device Dname="MB9AFA44L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40l.h"  define="MB9AFA44L"/>
        <debug      svd="SVD/MB9AFA4xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA44M'  ***************************** -->
      <device Dname="MB9AFA44M">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40m.h"  define="MB9AFA44M"/>
        <debug      svd="SVD/MB9AFA4xM.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="17"      m="12"/>
        <feature type="IOs"           n="80"/>
      </device>
      
      <!-- *************************  Device 'MB9AFA44N'  ***************************** -->
      <device Dname="MB9AFA44N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AA40NA/mb9aa40n.h"  define="MB9AFA44N"/>
        <debug      svd="SVD/MB9AFA4xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AA40NA-DS706-00038-2v0-E.pdf"                    title="MB9AA40NA Series Data Sheet"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9AFB40'  **************************** -->
      <subFamily DsubFamily="MB9AFB40">
        <feature type="DMA"           n="8"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="USBD"          n="1"/>
        <feature type="LCD"           n="1"/>
      
      <!-- *************************  Device 'MB9AFB41L'  ***************************** -->
      <device Dname="MB9AFB41L">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="40000000"/>
        <compile header="Device/Include/MB9AB40NA/mb9ab40l.h"  define="MB9AFB41L"/>
        <debug      svd="SVD/MB9AFB4xL.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x00200000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9AB40_64.FLM"     start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32DWF.FLM" start="0x00200000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9AB40NA-DS706-00034-2v0-E.pdf"                    title="MB9AB40NA Series Data Sheet"/>
        <feature type="ADC"           n="12"      m="12"/>
        <feature type="IOs"           n="64"/>
      </device>
      
