XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3LowPower_DFP.pdsc
    <condition id="MB9A150R">
      <description>Cypress FM3 MB9A150R Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF154M"/>
      <accept  Dname="MB9AF154N"/>
      <accept  Dname="MB9AF154R"/>
      <accept  Dname="MB9AF155M"/>
      <accept  Dname="MB9AF155N"/>
      <accept  Dname="MB9AF155R"/>
      <accept  Dname="MB9AF156M"/>
      <accept  Dname="MB9AF156N"/>
      <accept  Dname="MB9AF156R"/>
    </condition>

    <condition id="MB9A340NA">
      <description>Cypress FM3 MB9A340NA Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AF341L"/>
      <accept  Dname="MB9AF341M"/>
      <accept  Dname="MB9AF341N"/>
      <accept  Dname="MB9AF342L"/>
      <accept  Dname="MB9AF342M"/>
      <accept  Dname="MB9AF342N"/>
      <accept  Dname="MB9AF344L"/>
      <accept  Dname="MB9AF344M"/>
      <accept  Dname="MB9AF344N"/>
    </condition>

    <condition id="MB9AA40NA">
      <description>Cypress FM3 MB9AA40NA Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AFA41L"/>
      <accept  Dname="MB9AFA41M"/>
      <accept  Dname="MB9AFA41N"/>
      <accept  Dname="MB9AFA42L"/>
      <accept  Dname="MB9AFA42M"/>
      <accept  Dname="MB9AFA42N"/>
      <accept  Dname="MB9AFA44L"/>
      <accept  Dname="MB9AFA44M"/>
      <accept  Dname="MB9AFA44N"/>
    </condition>

    <condition id="MB9AB40NA">
      <description>Cypress FM3 MB9AB40NA Device</description>
      <require Dvendor="Cypress:19"/>
      <accept  Dname="MB9AFB41L"/>
      <accept  Dname="MB9AFB41M"/>
      <accept  Dname="MB9AFB41N"/>
      <accept  Dname="MB9AFB42L"/>
      <accept  Dname="MB9AFB42M"/>
      <accept  Dname="MB9AFB42N"/>
      <accept  Dname="MB9AFB44L"/>
      <accept  Dname="MB9AFB44M"/>
      <accept  Dname="MB9AFB44N"/>
    </condition>

    <condition id="FM3_LowPower CMSIS Device">
      <description>Cypress FM3 Low Power Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Cypress:19"/>
      <accept  condition="MB9A140NA"/>
      <accept  condition="MB9A150R"/>
      <accept  condition="MB9A340NA"/>
      <accept  condition="MB9AA40NA"/>
      <accept  condition="MB9AB40NA"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="FM3_LowPower CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Cypress FM3 device series</description>
      <files>

        <!-- additional include path -->
        <file category="include" name="Device/Include/"/>

        <!-- startup files -->
        <file category="source" name="Device/Source/MB9A140NA/startup_mb9af14x.s" attr="config"  condition="MB9A140NA"/>
        <file category="source" name="Device/Source/MB9A150R/startup_mb9af15x.s"  attr="config"  condition="MB9A150R"/>
        <file category="source" name="Device/Source/MB9A340NA/startup_mb9af34x.s" attr="config"  condition="MB9A340NA"/>
        <file category="source" name="Device/Source/MB9AA40NA/startup_mb9afa4x.s" attr="config"  condition="MB9AA40NA"/>
        <file category="source" name="Device/Source/MB9AB40NA/startup_mb9afb4x.s" attr="config"  condition="MB9AB40NA"/>

        <!-- system file -->
        <file category="source" name="Device/Source/MB9A140NA/system_mb9af14x.c"  attr="config"  condition="MB9A140NA"/>
        <file category="source" name="Device/Source/MB9A150R/system_mb9af15x.c"   attr="config"  condition="MB9A150R"/>
        <file category="source" name="Device/Source/MB9A340NA/system_mb9af34x.c"  attr="config"  condition="MB9A340NA"/>
        <file category="source" name="Device/Source/MB9AA40NA/system_mb9afa4x.c"  attr="config"  condition="MB9AA40NA"/>
        <file category="source" name="Device/Source/MB9AB40NA/system_mb9afb4x.c"  attr="config"  condition="MB9AB40NA"/>
      </files>
    </component>
  </components>
  
</package>
